---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT
source: html/b674450b-4483-7b13-e1d5-eb5a71cea3f9.htm
---
# StructuralSectionConcreteT Members

Creates a new instance of Structural Section Concrete T shape with the associated set of parameters,
 used to attach to structural element.